""" В этом задании вам предстоит написать свой собственные
модули и пакеты. Для этого вам будет необходимо создать
новый проект в PyCharm.
В вашем проекте файле должны быть:
1) 1 файл main;
2) папка с модулями в которой не менее 2х модулей;
3) 1 пакет с не менее чем 3мя папками в каждой папке по 2
файла, причем одна папка должна быть вложенной в другую
папку
4) В файлах должен быть написана функция которая бы сообщала
откуда импортирован этот файл.
Функции из всех файлов должны быть импортированы в
main.py """

"""  
Разделение кода на модули и пакеты помогает организовать код, сделать его более читаемым и поддерживаемым.

Создал в корне main.py
Cоздал в корне папку modules
    В ней добавил module1 и 2.py
Создал в корне package
    Создал файл __init__.py - Этот файл необходим для того, чтобы Python распознал папку как пакет. Он может быть пустым, но иногда в него добавляют код инициализации пакета.
    создал папку folder1
        создал файл file1.py
        создал файл file2.py
    создал папку folder2
        создал файл file1.py
        создал файл file1.py
        создал папку nested_folder
            создал файл file1.py
            создал файл file1.py
    создал папку folder3
        создайл файл file1.py
        создайл файл file1.py
"""