""" Напишите функцию, которая отображает на экран
форматированный текст, указанный ниже:
“Don't compare yourself with anyone in this world…
if you do so, you are insulting yourself.”
 Bill Gates """
 
#что нужно сделать то?

text = '''“Don't compare yourself with anyone in this world…
if you do so, you are insulting yourself.”
                                        Bill Gates '''

def text_vive (text):
    print(text)

text_vive(text)